ДОМАШНЕЕ ЗАДАНИЕ 2. AGILE


Ниже приведена разбивка по спринтам плана выбора, обучения и входа в IT. Каждый спринт дает оценимый результат, при этом группы спринтов, схожих по содержанию, но суммарно требующих большого периода времени, я объединила в смысловые блоки. Обучение запланировано по принципу от общего к частному (от базы, общей для всех специальностей, к более детальному изучению выбранной специфики). Также предусмотрен блок экспресс- практикумов, которые должны помочь погрузиться в специальности + прочувствовать, что ближе. Количество спринтов условно (безусловно, спринты с обучением нужны будут в бОльшем кол-ве)
• Продолжительность спринта – 2 недели
• В начале каждого спринта: анализ и постановка целей и задач на спринт, планирование задач по дням (напр.,
какие темы буду изучать, сколько задач должна решить и тд)
• Ежедневно стендап – что изучила вчера, что буду изучать сегодня, какие достижения и трудности
• Тестирование в каждом спринте – анализ пройденного, проверка знаний, оценка того, насколько материал
находит отклик во мне (верен ли выбор специализации или нужна корректировка обучения).
Блок
Спринт
Задачи спринта
Подзадачи спринта
1
1
Сбор и анализ общей информации о мире IT
1. Исследование материалов о мире IT, его специальностях, трендах (Интернет, друзья)
2. Формирование первой гипотезы, какие направления мне более интересны
2
1. Определение списка базовых IT дисциплин для погружения в профессию (знания, которые нужны для всех IT специальностей) 2. Выбор метода получения этих знаний (школа / самостоятельное обучение)
3. В случае выбора школы - оплата курса
2
Получение базовых IT знаний и навыков
Экспресс-погружение в интересующие специальности => уточнение и сужение выбора

Изучение дисциплины 1 Изучение дисциплины 2 Изучение дисциплины 3 Изучение дисциплины 4 Изучение дисциплины 5
Прохождение экспресс-практикума по специальности 1
Прохождение экспресс-практикума по специальности 2
Прохождение экспресс-практикума по специальности 3
Выбор метода получения знаний по выбранной специальности Выбор школы, заключение договора
Начало обучения по выбранной специальности
Обучение по специальности + мониторинг вакансий, требований для уточнения того, что нужно изучить
Обучение по специальности
Обучение по специальности + мониторинг вакансий, требований для уточнения того, что нужно изучить
Обучение по специальности
Обучение по специальности + мониторинг вакансий, требований для уточнения того, что нужно изучить
Обучение по специальности
Обучение по специальности + мониторинг вакансий, требований для уточнения того, что нужно изучить
Обучение по специальности
Подготовка резюме, самопрезентации, портфолио
Анализ вакансий, отклики, собеседования
Доп обучения по результатам собеседований
Анализ вакансий, отклики, собеседования
Доп обучения по результатам собеседований
Анализ вакансий, отклики, собеседования
Доп обучения по результатам собеседований
